{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Anger",
    "1": "Cognitive dysfunction",
    "2": "Emptiness",
    "3": "Hopelessness",
    "4": "Loneliness",
    "5": "No emotion",
    "6": "Sadness",
    "7": "Suicide intent",
    "8": "Worthlessness"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Anger": 0,
    "Cognitive dysfunction": 1,
    "Emptiness": 2,
    "Hopelessness": 3,
    "Loneliness": 4,
    "No emotion": 5,
    "Sadness": 6,
    "Suicide intent": 7,
    "Worthlessness": 8
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50273
}
