{
  "architectures": [
    "DebertaV2ForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Anger",
    "1": "Cognitive dysfunction",
    "2": "Emptiness",
    "3": "Hopelessness",
    "4": "Loneliness",
    "5": "No emotion",
    "6": "Sadness",
    "7": "Suicide intent",
    "8": "Worthlessness"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Anger": 0,
    "Cognitive dysfunction": 1,
    "Emptiness": 2,
    "Hopelessness": 3,
    "Loneliness": 4,
    "No emotion": 5,
    "Sadness": 6,
    "Suicide intent": 7,
    "Worthlessness": 8
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "transformers_version": "4.57.3",
  "type_vocab_size": 0,
  "vocab_size": 128009
}
